const advises = [
    "Когда дышите через рот очень горячим воздухом, приподымайте кончик языка к небу.Горячий пар, встречая на пути язык, входит в завихрение и дополнительно охлаждается.",

    "Дыхание должно быть ровным, спокойным и без напряжения. Когда станет совсем невмоготу от горячего пара, постарайтесь полностью сосредоточиться на дыхании и расслаблении всего тела. Как правило, такой прием позволяет увеличить нагрев внутренних органов и вместе с тем уменьшить обжигающее ощущение пара на кожные покровы.",

    "Во время парения не стесняйтесь бурно выражать свои эмоции. Считается, что этим проявляются инстинкты наших далеких предков по изгнанию вредоносной энергии из организма. Кряхтение, охи, ахи, стоны – все это усиливает оздоровительный эффект от горячего пара. Рев мужчины и визг женщины – нормальное поведение в парной.",

    "При слабом паре лучше дышать носом. По мере нагрева воздуха можно переходить на комбинированное дыхание носом и ртом. При сильном паре вдыхать носом болезненно (обжигает), поэтому дышать надо только ртом.",

    "Правило дыхания по мере нагрева парной можно обозначить так: углубленное дыхание;  уменьшенное углубленное дыхание; неглубокое и частое.",

    "При выходе из парной дышите ртом глубоко и часто.",

    "Проводя банные процедуры, не забывайте следить за своим дыханием. Делайте это правильно и со знанием дела!",

    "Нельзя париться в бане сразу после еды. Необходимо выдержать как минимум часовую паузу. Перед парной надо обязательно принять душ, но мочить голову при этом не стоит. Ни в коем случае не пейте перед парной или сауной алкоголь!",

    "Не стоит идти в баню сразу после тяжелых физических нагрузок. Гораздо больше пользы для организма вы получите если сначала немного отдохнете. И наоборот — после занятий умственным трудом, баня даст вам необходимый отдых и пойдет на пользу.",

    "Оставьте дома все украшения, особенно изготовленные из металла. Ими в парной можно запросто обжечься, а оставлять в предбаннике не всегда уместно.",

    "Веник, особенно заготовленный и засушенный загодя, перед парной следует минут 20-30 распарить в тазу с горячей водой. Это вернет его веткам необходимую эластичность. Париться веником следует примерно так же, как делать массаж. Начинать следует с ног, постепенно переходя выше. Веником надо орудовать скорее как опахалом – нагоняя с его помощью больше тепла, и лишь слегка массируя тело легкими поглаж",

    "Но вот все приготовления закончены и вы в парной. Не торопитесь начинать париться. Начните с нижней полки и постепенно прогреваясь поднимайтесь на верхние. Лучше париться лежа, поскольку тело чувствует температуру лучше а в сидячем положении голова находится выше и ее можно не заметив перегреть.",

    "Не торопитесь поддавать пар. В первый заход вхорошо прогретой бане поддавать пар следует совсем немного. Только для того, чтобы слегка повысить содержание пара в слишком сухом воздухе. Вообще, «поддавать пар» – плескать воду на камни, следует маленькими порциями. Во-первых, так вы не зальете каменку до ее полного остывания, а во-вторых, излишняя влажность в парной делает воздух тяжелым и затрудняет дыхание.",

    "Когда вы почувствуете, что достаточно пропотели, надо сделать перерыв. Выйдите из парной, ополоснитесь. После первого захода нырять в бассейн рановато, тело еще недостаточно прогрелось и можно вместо укрепления организма напротив его простудить. Лучше просто ополоснуться теплой или слегка прохладной водой и минут десять отдохнуть. Во второй и последующие заходы можно париться с веником и поддавать пару побольше.",

    "Количество заходов в парную всегда индивидуально. Зависит от желания и самочувствия. Парная – не место для соревнований по выносливости! Если почувствуете головокружение, вялость, затруднения в дыхании и учащенное сердцебиение, немедленно покиньте парную. Не следует экспериментировать и с охлаждением. Хорошо прогретый в бане человек не простудится от непродолжительного купания в проруби, снегу или холодном бассейне, но резкий перепад температур может вызвать резкое изменение артериального давления.",

    "Помните, вы посещаете баню, чтобы укрепить здоровье, а не наоборот! Прислушайтесь к нашим банным советам и поехжайте в баню с друзьями, чтобы почувствовать вкус настоящей русской бани!",

    "Ни в коем случае не разговаривайте о политике в бане!",

    "Слушаете советы бывалых членов клуба. Например, Славика.",

    "Сауна так же полезна для сердца, как физические упражнения. Недавнее исследование, проведенное в Университете Восточной Финляндии, показало, что даже 30-минутное пребывание в сауне вызывает снижение артериального давления и повышает эластичность стенок артерий. Кроме того, сауна стимулирует такую же частоту сердечных сокращений, как при умеренных физических нагрузках.",

    "Если Зиновий Михайлович вышел из парной, то будь добр - освободи лавку, чтобы генерал мог на ней отдохнуть.",

    "Самая полезная еда после бани приготовляется в ресторане 'Галерея вкуса'. Эдвард следит за этим. Так что не забудь попробовать.",
];

function getAdvice() {
    const idx = Math.floor(Math.random() * advises.length);
    return advises[idx];
}

module.exports = { getAdvice };
